#include <stdio.h>
#include <math.h>

void Quaternion_Err(float (*q)[4],float* p);
void Quaternion_Euler(float* p,float* q);

int main(void)
{
	int i,j;
	float a[2][4] = {{1,0,0,0},{0.766,0,0.643,0}};
	float b[4] = {0};
	float c[3] = {0};
	Quaternion_Err(a,b);
	Quaternion_Euler(b,c);
	return 0;
}

//保存两个四元数的二位数组
void Quaternion_Err(float (*q)[4],float* p)
{
	int i;
	for(i=1;i<4;i++)
	{
		*(*(q+1)+i) = -*(*(q+1)+i); //共轭
	}
	printf("\n");
	*p = (*(*(q)))*(*(*(q+1)))-(*(*(q)+1))*(*(*(q+1)+1))-(*(*(q)+2))*(*(*(q+1)+2))-(*(*(q)+3))*(*(*(q+1)+3));//w
	*(p+1) =(*(*(q)))*(*(*(q+1)+1))+(*(*(q+1)))*(*(*(q)+1))+(*(*(q)+2))*(*(*(q+1)+3))-(*(*(q+1)+2))*(*(*(q)+3));//i
	*(p+2) =(*(*(q)))*(*(*(q+1)+2))+(*(*(q+1)))*(*(*(q)+2))+(*(*(q)+3))*(*(*(q+1)+1))-(*(*(q+1)+3))*(*(*(q)+1));//j
	*(p+3) =(*(*(q)))*(*(*(q+1)+3))+(*(*(q+1)))*(*(*(q)+3))+(*(*(q)+1))*(*(*(q+1)+2))-(*(*(q+1)+1))*(*(*(q)+2));//k
	printf("%0.5f %0.5f %0.5f %0.5f\n",*p,*(p+1),*(p+2),*(p+3));
}

void Quaternion_Euler(float* p,float* q)
{
	*q = asin(-2 * (*(p+1)) * (*(p+3)) + 2 * (*p)* (*(p+2)))* 57.3;//pitch
	*(q+1) = atan2(2 * (*(p+2)) * (*(p+3)) + 2 * (*p) * (*(p+1)), -2 * (*(p+1)) * (*(p+1)) - 2 * (*(p+2))* (*(p+2)) + 1)* 57.3;//roll
	*(q+2) = atan2(2*((*(p+1))*(*(p+2)) + (*p)*(*(p+3))),(*p)*(*p)+(*(p+1))*(*(p+1))-(*(p+2))*(*(p+2))-(*(p+3))*(*(p+3)))* 57.3; //yaw
	printf("pitch:%0.5f   roll:%0.5f   yaw:%0.5f\n",*q,*(q+1),*(q+2));
}